Autodesk.Navisworks.Api.Plugins.RibbonTabRecord
Represents the definition of a ribbon tab in the GUI system.

Autodesk.Navisworks.Api.Plugins.RibbonTabRecord.DisplayName
The text to be displayed for this Ribbon tab

Autodesk.Navisworks.Api.Plugins.RibbonTabRecord.Id
The full Id of the ribbon tab. This is a combination of
and Plugin.Id